<template>
    <div class="desc-container">
        <h3>{{ goodsDesc.title }}</h3>

        <hr />

        <div class="content" v-html="goodsDesc.content">

        </div>
    </div>
</template>

<script>
    export default {
        data(){
            return{
                goodsDesc:{ // 存放图文介绍数据
                    title:"艾珠儿 连衣裙套装女春夏装2020新款女装",
                    content:"民族风就如职场优雅风那般“百搭”，基本不挑人群，谁都合适。民族风给人一种复古的味道，很有中国传统美。民族风的服装穿起来很独特又显气质，无论你什么身材什么年龄段，穿起来都能为你增添魅力散发无限光彩。艾珠儿 连衣裙套装女春夏装2020新款女装韩版休闲牛仔套装裙刺绣格子衬衫中长款雪纺裙子两件套套装裙,鸭鸭服饰连衣裙2020夏季新款蕾丝女装短袖仙女超仙修身显瘦森系雪纺连衣裙一字肩上衣网纱两件套装裙子,尚贝珊连衣裙女装2020夏季衣服短袖新款时尚套装女韩版夏天大码显瘦休闲中长碎花雪纺棉麻两件套套装裙子，花姿海雪纺连衣裙女2020夏季新款大码女装时尚气质女士棉麻中长印小个子碎花连衣裙蕾丝两件套装裙子女,丹仙奴棉麻连衣裙套装女2020时尚夏季新款韩版休闲裙子小个子连衣裙亚麻两件套 上蓝下藏青，威乐曼连衣裙2020夏季新品女装时尚小清新宽松两件套套装女短袖T恤汉服收腰显瘦雪纺性感裙子,欧美高级风给人很高大上的感觉，简直是行走在时尚的边缘。不过，这种风格一般只有气场强大的女性才能驾驭得了。这种风格深受众多超模喜爱，让你变身成为人群中的焦点。只是，小个子以及气场不足的妹子们就别轻易尝试了，毕竟在身高上就已经“输了”，还是寻找适合自己的风格吧！高个子女生的气质与气场，总是让小个子女生羡慕不已。不过其实，每个人都有自己的风格气质与特点，我们无需过于羡慕别人。甜美可爱风最适合小个子女生了，准确来说，应该是只有小个子的女生才能完美驾驭，男生看了都很有保护欲呢！而高个子女生就别尝试什么可爱风了，画风会很奇怪，甜美风倒可以考虑~温婉优雅淑女风，是一种许多女性都喜欢的风格，这种类型的女生，同样是男性所喜欢的对象。职场风也有着优雅淑女与温婉的感觉，这类服装给人落落大方的感觉，最适合本来就很文静又有气质的女生啦！一般来说，这种风格很多妹子都合适，只要你不是很“男人婆”就好！"
                }
            }
        },

        created(){
            // this.getGoodsDesc();
        },

        methods:{
            // getGoodsDesc(){
            //     // 获取图文介绍数据 url：/api/goods/getdesc/:id
            //     this.$http.get('api/goods/getdesc/'+ this.$route.params.id).then(function (result) {
            //         if (result.body.status === 0){
            //             this.goodsDesc = result.body.message[0];
            //         }
            //     })
            // }
        }
    }
</script>

<style lang="scss" scoped>

    .desc-container h3{
        color: #26a2ff;
        font-size: 13px;
        text-align: center;
        line-height: 40px;
    }


    .content{
        padding: 5px;
    }

</style>